<template>
  <a-tabs>
    <a-tab-pane key="1" tab="概述">
      <a-image :src="`${baseUrl}/math-outline.jpg`" :preview="false"></a-image>
      <a-typography-paragraph>
        <pre>
整数部分：

十进制计数法：一（个）、十、百、千、万……都叫做计数单位.其中“一”是计数的基本单位.10个1是10,10个10是100……每相邻两个计数单位之间的进率都是十.这种计数方法叫做十进制计数法

整数的读法：从高位一级一级读,读出级名（亿、万）,每级末尾0都不读.其他数位一个或连续几个0都只读一个“零”.

整数的写法：从高位一级一级写,哪一位一个单位也没有就写0.

四舍五入法：求近似数,看尾数最高位上的数是几,比5小就舍去,是5或大于5舍去尾数向前一位进1.这种求近似数的方法就叫做四舍五入法.

整数大小的比较：位数多的数较大,数位相同最高位上数大的就大,最高位相同比看第二位较大就大,以此类推.

小数部分：

把整数1平均分成10份、100份、1000份……这样的一份或几份是十分之几、百分之几、千分之几……这些分数可以用小数表示.如1/10记作0.1,7/100记作0.07.

小数点右边第一位叫十分位,计数单位是十分之一（0.1）；第二位叫百分位,计数单位是百分之一（0.01）……小数部分最大的计数单位是十分之一,没有最小的计数单位.小数部分有几个数位,就叫做几位小数.如0.36是两位小数,3.066是三位小数

小数的读法：整数部分整数读,小数点读点,小数部分顺序读.

小数的写法：小数点写在个位右下角.

小数的性质：小数末尾添0去0大小不变.化简

小数点位置移动引起大小变化：右移扩大左缩小,1十2百3千倍.

小数大小比较：整数部分大就大；整数相同看十分位大就大；以此类推.

分数和百分数

■分数和百分数的意义

1、 分数的意义：把单位“ 1” 平均分成若干份,表示这样的一份或者几份的数,叫做分数.在分数里,表示把单位“ 1” 平均分成多少份的数,叫做分数的分母；表示取了多少份的数,叫做分数的分子；其中的一份,叫做分数单位.

2、 百分数的意义：表示一个数是另一个数的百分之几的数,叫做百分数.也叫百分率或百分比.百分数通常不写成分数的形式,而用特定的“%”来表示.百分数一般只表示两个数量关系之间的倍数关系,后面不能带单位名称.

3、 百分数表示两个数量之间的倍比关系,它的后面不能写计量单位.

4、 成数：几成就是十分之几.

■分数的种类

按照分子、分母和整数部分的不同情况,可以分成：真分数、假分数、带分数

■分数和除法的关系及分数的基本性质

1、 除法是一种运算,有运算符号；分数是一种数.因此,一般应叙述为被除数相当于分子,而不能说成被除数就是分子.

2、 由于分数和除法有密切的关系,根据除法中“商不变”的性质可得出分数的基本性质.

3、 分数的分子和分母都乘以或者除以相同的数（0除外）,分数的大小不变,这叫做分数的基本性质,它是约分和通分的依据.

■约分和通分

1、 分子、分母是互质数的分数,叫做最简分数.

2、 把一个分数化成同它相等但分子、分母都比较小的分数,叫做约分.

3、 约分的方法：用分子和分母的公约数（1除外）去除分子、分母；通常要除到得出最简分数为止.

4、 把异分母分数分别化成和原来分数相等的同分母分数,叫做通分.

5、 通分的方法：先求出原来几个分母的最小公倍数,然后把各分数化成用这个最小公倍数作分母的分数.

■倒 数

1、 乘积是1的两个数互为倒数.

2、 求一个数（0除外）的倒数,只要把这个数的分子、分母调换位置.

3、 1的倒数是1,0没有倒数

■分数的大小比较

1、 分母相同的分数,分子大的那个分数就大.

2、 分子相同的分数,分母小的那个分数就大.

3、 分母和分子都不同的分数,通常是先通分,转化成通分母的分数,再比较大小.

4、 如果被比较的分数是带分数,先要比较它们的整数部分,整数部分大的那个带分数就大；如果整数部分相同,再比较它们的分数部分,分数部分大的那个带分数就大.

■百分数与折数、成数的互化：

例如：三折就是30％,七五折就是75％,成数就是十分之几,如一成就是牐 闯砂俜质 褪?0%,则六成五就是65%.

■纳税和利息：

税率：应纳税额与各种收入的比率.

利率：利息与本金的百分率.由银行规定按年或按月计算.

利息的计算公式：利息=本金×利率×时间

百分数与分数的区别主要有以下三点：

1．意义不同.百分数是“表示一个数是另一个数的百分之几的数.”它只能表示两数之间的倍数关系,不能表示某一具体数量.如：可以说 1米 是 5米 的 20％,不可以说“一段绳子长为20％米.”因此,百分数后面不能带单位名称.分数是“把单位‘1’平均分成若干份,表示这样一份或几份的数”.分数不仅 可以表示两数之间的倍数关系,如：甲数是3,乙数是4,甲数是乙数的?；还可以表示一定的数量.

2．应用范围不同.百分数在生产、工作和生活中,常用于调查、统计、分析与比较.而分数常常是在测量、计算中,得不到整数结果时使用.

3．书写形式不同.百分数通常不写成分数形式,而采用百分号“％”来表示.如：百分之四十五,写作：45％；百分数的分母固定为100,因此,不论百分数 的分子、分母之间有多少个公约数,都不约分；百分数的分子可以是自然数,也可以是小数.而分数的分子只能是自然数,它的表示形式有：真分数、假分数、带分 数,计算结果不是最简分数的一般要通过约分化成最简分数,是假分数的要化成带分数.

数的整除

■整除的意义

整数a除以整数b（b≠0）,除得的商正好是整数而没有余数,我们就说a能被b整除（也可以说b能整除a）

除尽的意义 甲数除以乙数,所得的商是整数或有限小数而余数也为0时,我们就说甲数能被乙数除尽,（或者说乙数能除尽甲数）这里的甲数、乙数可以是自然数,也可以是小数（乙数不能为0）.

■约数和倍数

1、如果数a能被数b整除,a就叫b的倍数,b就叫a的约数.2、一个数的约数的个数是有限的,其中最小的约数是1,最大的约数是它本身.3、一个数的倍数的个数是无限的,其中最小的是它本身,它没有最大的倍数.

■奇数和偶数

1、能被2整除的数叫偶数.例如：0、2、4、6、8、10……注：0也是偶数 2、不能被2整除的数叫基数.例如：1、3、5、7、9……

■整除的特征

1、能被2整除的数的特征：个位上是0、2、4、6、8.

2、能被5整除的数的特征：个位上是0或5.

3、能被3整除的数的特征：一个数的各个数位上的数之和能被3整除,这个数就能被3 整除.

■质数和合数

1、一个数只有1和它本身两个约数,这个数叫做质数（素数）.

2、一个数除了1和它本身外,还有别的约数,这个数叫做合数.

3、1既不是质数,也不是合数.

4、自然数按约数的个数可分为：质数、合数

5、自然数按能否被2整除分为：奇数、偶数

■分解质因数

1、每个合数都可以写成几个质数相乘的形式,这几个质数叫做这个合数的质因数.例如：18=3×3×2,3和2叫做18的质因数.

2、把一个合数用几个质因数相乘的形式表示出来,叫做分解质因数.通常用短除法来分解质因数.

3、几个数公有的因数叫做这几个数的公因数.其中最大的一个叫这几个数的最大公因数.公因数只有1的两个数,叫做互质数.几个数公有的倍数叫做这几个数的公倍数.其中最大的一个叫这几个数的最大公倍数.

4、特殊情况下几个数的最大公约数和最小公倍数.（1）如果几个数中,较大数是较小数的倍数,较小数是较大数的约数,则较大数是它们的最小公倍数,较小数是它们的最大公约数.（2）如果几个数两两互质,则它们的最大公约数是1,小公倍数是这几个数连乘的积.

■奇数和偶数的运算性质：

1、相邻两个自然数之和是奇数,之积是偶数.

2、奇数 奇数=偶数,奇数 偶数=奇数,偶数 偶数=偶数；奇数-奇数=偶数,

奇数-偶数=奇数,偶数-奇数=奇数,偶数-偶数=偶数；奇数×奇数=奇数,奇数×偶数=偶数,偶数×偶数=偶数.

整数、小学、分数四则混合运算

■四则运算的法则

1、加法a、整数和小数：相同数位对齐,从低位加起,满十进一b、同分母分数：分母不变,分子相加；异分母分数：先通分,再相加

2、减法a、整数和小数：相同数位对齐,从低位减起,哪一位不够减,退一当十再减b、同分母分数：分母不变,分子相减；异分母分数：先通分,再相减

3、乘法a、整数和小数：用乘数每一位上的数去乘被乘数,用哪一位上的数去乘,得数的末位就和哪一位对起,最后把积相加,因数是小数的,积的小数位数与两位因数的小数位数相同b、分数：分子相乘的积作分子,分母相乘的积作分母.能约分的先约分,结果要化简

4、除法a、整数和小数：除数有几位,先看被除数的前几位,（不够就多看一位）,除到被除数的哪一位,商就写到哪一位上.除数是小数是,先化成整数再除,商中的小数点与被除数的小数点对齐b、甲数除以乙数（0除外）,等于甲数除以乙数的倒数

■运算定律

加法交换律 a＋b=b＋a

结合律 （a＋b）＋c=a＋（b＋c）

减法性质 a－b－c=a－（b＋c）

a－（b－c）=a－b＋c

乘法交换律 a×b=b×a

结合律 （a×b）×c=a×（b×c）

分配律 （a＋b）×c=a×c＋b×c

除法性质 a÷（b×c）=a÷b÷c

a÷（b÷c）=a÷b×c

（a＋b）÷c=a÷c＋b÷c

（a－b）÷c=a÷c－b÷c

商不变性质m≠0 a÷b=（a×m）÷（b×m） =（a÷m）÷（b÷m）

■积的变化规律：在乘法中,一个因数不变,另一个因数扩大（或缩小）若干倍,积也扩大（或缩小）相同的倍数.

推广：一个因数扩大A倍,另一个因数扩大B倍,积扩大AB倍.

一个因数缩小A倍,另一个因数缩小B倍,积缩小AB倍.

■商不变规律：在除法中,被除数和除数同时扩大（或缩小）相同的倍数,商不变.

推广：被除数扩大（或缩小）A倍,除数不变,商也扩大（或缩小）A倍.

被除数不变,除数扩大（或缩小）A倍,商反而缩小（或扩大）A倍.

■利用积的变化规律和商不变规律性质可以使一些计算简便.但在有余数的除法中要注意余数.

如：8500÷200= 可以把被除数、除数同时缩小100倍来除,即85÷2= ,商不变,但此时的余数1是被缩小100被后的,所以还原成原来的余数应该是100.

简易方程

■用字母表示数

用字母表示数是代数的基本特点.既简单明了,又能表达数量关系的一般规律.

■用字母表示数的注意事项

1、数字与字母、字母和字母相乘时,乘号可以简写成“•“或省略不写.数与数相乘,乘号不能省略.

2、当1和任何字母相乘时,“ 1” 省略不写.

3、数字和字母相乘时,将数字写在字母前面.

■含有字母的式子及求值

求含有字母的式子的值或利用公式求值,应注意书写格式

■等式与方程

表示相等关系的式子叫等式.

含有未知数的等式叫方程.

判断一个式子是不是方程应具备两个条件：一是含有未知数；二是等式.所以,方程一定是等式,但等式不一定是方程.

■方程的解和解方程

使方程左右两边相等的未知数的值,叫方程的解.

求方程的解的过程叫解方程.

■在列方程解文字题时,如果题中要求的未知数已经用字母表示,解答时就不需要写设,否则首先演将所求的未知数设为x.

■解方程的方法

1、直接运用四则运算中各部分之间的关系去解.如x-8=12

加数 加数=和 一个加数=和－另一个加数

被减数－减数=差 减数=被减数－差 被减数=差＋减数

被乘数×乘数=积 一个因数=积÷另一个因数

被除数÷除数=商 除数=被除数÷商 被除数=除数×商

2、先把含有未知数x的项看作一个数,然后再解.如3x 20=41

先把3x看作一个数,然后再解.

3、按四则运算顺序先计算,使方程变形,然后再解.如2.5×4-x=4.2,

要先求出2.5×4的积,使方程变形为10-x=4.2,然后再解.

4、利用运算定律或性质,使方程变形,然后再解.如：2.2x＋7.8x＝20

先利用运算定律或性质使方程变形为（2.2＋7.8）x＝20,然后计算括号里面使方程变形为10x＝20,最后再解.

比和比例

■比和比例应用题

在工业生产和日常生活中,常常要把一个数量按照一定的比例来进行分配,这种分配方法通常叫“按比例分配”.

■解题策略

按比例分配的有关习题,在解答时,要善于找准分配的总量和分配的比,然后把分配的比转化成分数或份数来进行解答

■正、反比例应用题的解题策略

1、审题,找出题中相关联的两个量

2、分析,判断题中相关联的两个量是成正比例关系还是成反比例关系.

3、设未知数,列比例式

4、解比例式

5、检验,写答语

数感和符号感

■在数学教学中发展学生的数感主要指,使学生具有应用数字表示具体的数据和数量关系的能力；能够判定不同的算术运算,有能力进行计算,并具有选择适当方法（心算、笔算、使用计算器）实施计算的经验；能根据数据进行推论,并对数据和推论的精确性和可靠性进行检验,等等.

■培养学生的数感的目的就在于使学生学会数学地思考,学会用数学的方法理解和解释现实问题.

■ 数感的培养有利于学生提出问题和解决问题能力的提高.学生在遇到问题时,自觉主动地与一定的数学知识和技能建立起联系,这样才有可能建构与具体事物相联系 的数学模型.具备一定的数感是完成这类任务的重要条件.如,怎样为参加学校运动会的全体运动员编号?这是一个实际问题,没有固定的解法,你可以用不同的方 式编,而不同的编排方案可能在实用性和便捷性上是不同的.如,从号码上就可以分辨出年级和班级,区分出男生和女生,或很快的知道一名队员是参加哪类项目.

■ 数概念本身是抽象的,数概念的建立不是一次完成的,学生理解和掌握数的概念要经历一个过程.让学生在认识数的过程中,更多地接触和经历有关的情境和实例, 在现实的背景下感受和体验会使学生更具体更深刻地把握数的概念,建立数感.在认识数的过程中,让学生说一说自己身边的数,生活中用到的数,如何用数表示周 围的事物等,会让学生感觉到数就在自己身边,运用数可以简单明了地表示许多现象.估计一页书的字数,一本书有多少页,一把黄豆有多少粒等,这些对具体数量 的感知与体验,是学生建立数感的基础,这对学生理解数的意义会有很大的帮助.

■无论在哪个学段,都应鼓励学生用自己独特的方式表示具体的情境中的数量关系和变化规律,这是发展学生符号感的决定性因素.

■引进字母表示,是学习数学符号、学会用符号表示具体情境中隐含的数量关系和变化规律的重要一步.尽可能从实际问题中引入,使学生感受到字母表示的意义.

第一,用字母表示运算法则、运算定律以及计算公式.算法的一般化,深化和发展了对数的认识.

第二,用字母表示现实世界和各门学科中的各种数量关系.例如,匀速运动中的速度v、时间t和路程s的关系是s=vt.

第三,用字母表示数,便于从具体情境中抽象出数量关系和变化规律,并确切地表示出来,从而有利于进一步用数学知识去解决问题.例如,我们用字母表示实际问题中的未知量,利用问题中的相等关系列出方程.

■字母和表达式在不同场合有不同的意义.如：

5=2x 1表示x所满足的一个条件,事实上,x这里只占一个特殊数的位置,可以利用解方程找到它的值；

Y=2x表示变量之间的关系,x是自变量,可以取定义域内任何数,y是因变量,y随x的变换而变化；

（a b）（a－b）=a－b表示一个一般化的算法,表示一个恒等式；

如果a和b分别表示矩形的长和宽,S表示矩形的面积,那么S=ab表示计算矩形面积公式,同时也表示矩形的面积随长和宽的变化而变化.

■如何培养学生的符号感

要尽可能在实际问题情境中帮助学生理解符号以及表达式、关系式意义,在解决实际问题中发展学生的符号感.

必须要对符号运算进行训练,要适当地、分阶段地进行一定数量的符号运算.但是并不主张进行过繁的形式运算训练.

学生的符号感的发展不是一朝一夕就可以完成的,而是应该贯穿于数学学习的全过程,伴随着学生数学思维的提高逐步发展.

量的计算

■事物的多少、长短、大小、轻重、快慢等,这些可以测定的客观事物的特征叫做量.把一个要测定的量同一个作为标准的量相比较叫做计量.用来作为计量标准的量叫做计量单位.

■数 单位名称=名数

只带有一个单位名称的叫做单名数.

带有两个或两个以上单位名称的叫做复名数

高级单位的数如把米改成厘米 低级单位的数如把厘米改成米

■只带有一个单位名称的数叫做单名数.如：5小时, 3千克 （只有一个单位的）

带有两个或两个以上单位名称的叫做复名数.如：5小时6分,3千克500克（有两个单位的）

56平方分米=(0.56)平方米 就是单名数转化成单名数

560平方分米=(5)平方米(60平方分米) 就是单名数转化成复名数的例子.

■高级单位与低级单位是相对的.比如,"米"相对于分米,就是高级单位,相对于千米就是低级单位.

■常用计算公式表

(1)长方形面积=长×宽,计算公式s=a b

(2)正方形面积=边长×边长,计算公式s=a×a

(3)长方形周长：(长 宽)× 2,计算公式s=(a b)×2

(4)正方形周长=边长× 4,计算公式s= 4a

(5)平形四边形面积=底×高,计算公式s=ah．

(6)三角形面积=底×高÷2,计算公式s=a×h÷2

(7)梯形面积=(上底 下底)×高÷2,计算公式s=(a b)×h÷2

(8)长方体体积=长×宽×高,计算公式v=abh

(9)圆的面积=圆周率×半径平方,计算公式s=лr^2

(10)正方体体积=棱长×棱长×棱长,计算公式v=a^3

(11)长方体和正方体的体积都可以写成底面积×高,计算公式v=sh

(12)圆柱的体积=底面积×高,计算公式v=s h

■1年12个月(31天的月份有1、3、5、7、8、10、12月份,30天的月份有4、6、9、11．月份,平年2月28天,闰年2月29天

■闰年年份是4的倍数,整百年份须是400的倍数.

■平年一年365天,闰年一年366天.

■公元1年—100年是第一世纪,公元1901—2000是第二十世纪.

平面图形的认识和计算

■三角形

1、三角形是由三条线段围成的图形.它具有稳定性.从三角形的一个顶点到它的对边作一条垂线,顶点和垂足之间的线段叫做三角形的高.一个三角形有三条高.

2、三角形的内角和是180度

3、三角形按角分,可以分为：锐角三角形、直角三角形、钝角三角形

4、三角形按边分,可以分为：等腰三角形、等边三角形、不等边三角形

■四边形

1、四边形是由四条线段围成的图形.

2、任意四边形的内角和是360度.

3、只有一组对边平行的四边形叫梯形.

4、两组对边分别平行的四边形叫平行四边形,它容易变形.长方形、正方形是特殊的平行四边形；正方形是特殊的长方形.

■圆

圆是平面上的一种曲线图形.同圆或等圆的直径都相等,直径等于半径的2倍.圆有无数条对称轴.圆心确定圆的位置,半径确定圆的大小.

■扇形 由圆心角的两条半径和它所对的弧围成的图形.扇形是轴对称图形.

■轴对称图形

1、如果一个图形沿着一条直线对折,两边的图形能够完全重合,这个图形叫做轴对称图形；这条窒息那叫做对称轴.

2、线段、角、等腰三角形、长方形、正方形等都是轴对称图形,他们的对称轴条数不等.

■周长和面积

1、平面图形一周的长度叫做周长.

2、平面图形或物体表面的大小叫做面积.

3、常见图形的周长和面积计算公式
        </pre>
      </a-typography-paragraph>
    </a-tab-pane>
    <a-tab-pane key="2" tab="目录">
      <a-row>
        <button @click="go('/math/calculate')" class="friendly-btn round">🧮计算</button>
      </a-row>
    </a-tab-pane>
  </a-tabs>
</template>

<script>
import {useBreadItem} from "@/stores/breadItem";
export default {
  name: "MathView",
  data() {
    return {
      baseUrl: import.meta.env.BASE_URL,
    };
  },
  beforeMount() {
    const items = useBreadItem()
    items.set('数学')
  },
  methods: {
    go(href) {
      this.$router.push(href)
    }
  }
}
</script>

<style scoped>

</style>
